src/app/Http/Controllers/UserController.php

    public function userList(Request $request)
    {
        $users = User::all();
---
select * from `users`

    public function userCreate(Request $request)
    {
        if (request()->img_path) {
            $file_name = time() . '.' . request()->img_path->getClientOriginalName();
            request()->img_path->storeAs('public/image', $file_name);

            $user = new User();
            $user->img_path = 'image/' . $file_name;
            $user->name = $request->name;
            $user->email = $request->email;
            $user->password = $request->password;
            $user->se_career = $request->se_career;
            $user->introduction = $request->introduction;
            $user->save();
        } else {
            $user = new User();
            $user->img_path = null;
            $user->name = $request->name;
            $user->email = $request->email;
            $user->password = $request->password;
            $user->se_career = $request->se_career;
            $user->introduction = $request->introduction;
            $user->save();
---
INSERT into `users` (`img_path`, `name`, `email`, `password`, `se_career`, `introduction`, `updated_at`, `created_at`) values ('', 'fadfasdf', '', '', '3', 'adsfasdfasdf', '2020-07-25 22:16:18', '2020-07-25 22:16:18')

    public function skillInfos(Request $request)
    {
        $skillInfos = $request->all();
        $userSkillRecord = [];

        //TODO skillInfos[0]はスキル情報を持たない仕様はスマートではない。中間テーブルを用いた処理をもっと簡単、且つ綺麗にしたい。
        foreach ($skillInfos as $key => $valueAsJson) {
            if ($key == 0) {
                $value = json_decode($valueAsJson, true);
                $userIdRecord = User::select('id')->where('name', $value['name'])->get();
                $userId = $userIdRecord[0]['id'];

                continue; //skillInfos[0]はスキル情報を持たないため
            } else {
                //JSON文字列をデコードする→これをしないと、$hoge['key']のようにして値を取得できない。
                $value = json_decode($valueAsJson, true);

                //各要素をキー（skillName,skillLevel）を元に取得する
                //ここで格納されたレコードは、中間テーブルに反映される
                $userSkill = Tag::select('id')->where('ct_name', $value['skillName'])->where('ct_level', $value['skillLevel'])->get();
---
select `id` from `users` where `name` = 'asdfasdfasd'
select `id` from `tags` where `ct_name` = 'Pascal' and `ct_level` = 1

            $tagMap = new TagMap();
            $tagMap->user_id = $userId;
            $tagMap->tag_id = $userSkillRecord[$i];
            $tagMap->save();
---
insert into `tag_maps` (`user_id`, `tag_id`, `updated_at`, `created_at`) values (136, 61, '2020-07-27 02:05:26', '2020-07-27 02:05:26')

        // ];


        $user = User::select('id', 'name', 'se_career', 'introduction', 'img_path')->where('id', $request->id)->update($update_column);
---
select `id`, `name`, `se_career`, `introduction`, `img_path` from `users` where `id` in (111, 132)

    public function showAllUsers()
    {
        return User::select('id', 'name', 'se_career', 'introduction', 'img_path')->get();
---
select `id` from `users` where `name` = 'マイケール'

    public function getUserSkills($userId)
    {

        $result = TagMap::select('tag_id')->where('user_id', $userId)->get();

        //TODO DBを検索して、対象のスキルを持ったユーザーをJSONで返す
        return
            Tag::select('id', 'ct_name', 'ct_level')->whereIn('id', $result)->get();
---
SELECT `id`, `ct_name` FROM `tags` WHERE `ct_level` = '1'

    public function getSuggestionListTags()
    {
        //スキル名の重複を避ける
        $skillTags = Tag::select('id', 'ct_name')->where('ct_level', 1)->get();
---
SELECT `id`, `ct_name` FROM `tags` WHERE `ct_level` = '1'